Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/edc/PIC32MZ1024EFH064.PIC
      <edc:SFRDef edc:_addr="0x1F84B0E0" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="23" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC3TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC3TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0E4" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="24" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC4TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC4TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B0E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F84B0F0" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:cname="ADCEIEN1" edc:desc="" edc:impl="0x7ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------0000000000000000000" edc:name="ADCEIQEN1" edc:nzwidth="32" edc:por="-------------0000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIEN0" edc:mask="0x1" edc:name="EIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN1" edc:mask="0x1" edc:name="EIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN2" edc:mask="0x1" edc:name="EIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN3" edc:mask="0x1" edc:name="EIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN4" edc:mask="0x1" edc:name="EIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN5" edc:mask="0x1" edc:name="EIEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN6" edc:mask="0x1" edc:name="EIEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN7" edc:mask="0x1" edc:name="EIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN8" edc:mask="0x1" edc:name="EIEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN9" edc:mask="0x1" edc:name="EIEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN10" edc:mask="0x1" edc:name="EIEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN11" edc:mask="0x1" edc:name="EIEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN12" edc:mask="0x1" edc:name="EIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN13" edc:mask="0x1" edc:name="EIEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN14" edc:mask="0x1" edc:name="EIEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN15" edc:mask="0x1" edc:name="EIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN16" edc:mask="0x1" edc:name="EIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN17" edc:mask="0x1" edc:name="EIEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN18" edc:mask="0x1" edc:name="EIEN18" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0F4" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="-------------------nn-----------" edc:cname="ADCEIEN2" edc:desc="" edc:impl="0x1800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00-----------" edc:name="ADCEIQEN2" edc:nzwidth="32" edc:por="-------------------00-----------" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIEN43" edc:mask="0x1" edc:name="EIEN43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN44" edc:mask="0x1" edc:name="EIEN44" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0F8" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:cname="ADCEISTAT1" edc:desc="" edc:impl="0x7ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------0000000000000000000" edc:name="ADCEISTAT1" edc:nzwidth="32" edc:por="-------------0000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY0" edc:mask="0x1" edc:name="EIRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY1" edc:mask="0x1" edc:name="EIRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY2" edc:mask="0x1" edc:name="EIRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY3" edc:mask="0x1" edc:name="EIRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY4" edc:mask="0x1" edc:name="EIRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY5" edc:mask="0x1" edc:name="EIRDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY6" edc:mask="0x1" edc:name="EIRDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY7" edc:mask="0x1" edc:name="EIRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY8" edc:mask="0x1" edc:name="EIRDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY9" edc:mask="0x1" edc:name="EIRDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY10" edc:mask="0x1" edc:name="EIRDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY11" edc:mask="0x1" edc:name="EIRDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY12" edc:mask="0x1" edc:name="EIRDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY13" edc:mask="0x1" edc:name="EIRDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY14" edc:mask="0x1" edc:name="EIRDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY15" edc:mask="0x1" edc:name="EIRDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY16" edc:mask="0x1" edc:name="EIRDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY17" edc:mask="0x1" edc:name="EIRDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY18" edc:mask="0x1" edc:name="EIRDY18" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0FC" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="-------------------rr-----------" edc:cname="ADCEISTAT2" edc:desc="" edc:impl="0x1800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00-----------" edc:name="ADCEISTAT2" edc:nzwidth="32" edc:por="-------------------00-----------" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIRDY43" edc:mask="0x1" edc:name="EIRDY43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY44" edc:mask="0x1" edc:name="EIRDY44" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
