Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/edc/PIC32MZ1024EFH064.PIC
      <edc:SFRDef edc:_addr="0x1F8822A0" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="-------------------nnnnn---nnnnn" edc:cname="EMAC1MADR" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxx00001xxx00000" edc:name="EMAC1MADR" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxx00001xxx00000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMADR"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REGADDR" edc:desc="" edc:mask="0x1" edc:name="REGADDR" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PHYADDR" edc:desc="" edc:mask="0x1" edc:name="PHYADDR" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8822B0" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1MWTD" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="EMAC1MWTD" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMWTD"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MWTD" edc:desc="" edc:mask="0xffff" edc:name="PEMACMWTD" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8822C0" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1MRDD" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="EMAC1MRDD" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMRDD"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MRDD" edc:desc="" edc:mask="0x1" edc:name="MRDD" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8822D0" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="----------------------------nnnn" edc:cname="EMAC1MIND" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxx0000" edc:name="EMAC1MIND" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxx0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMIND"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MIIMBUSY" edc:desc="" edc:mask="0x1" edc:name="MIIMBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCAN" edc:desc="" edc:mask="0x1" edc:name="SCAN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTVALID" edc:desc="" edc:mask="0x1" edc:name="NOTVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINKFAIL" edc:desc="" edc:mask="0x1" edc:name="LINKFAIL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8822E0" edc:offset="32"/>
      <edc:SFRDef edc:_addr="0x1F882300" edc:_begin="0x300" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1SA0" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="EMAC1SA0" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxSA0"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STNADDR5" edc:desc="" edc:mask="0x1" edc:name="STNADDR5" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STNADDR6" edc:desc="" edc:mask="0x1" edc:name="STNADDR6" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882310" edc:_begin="0x300" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1SA1" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="EMAC1SA1" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxSA1"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STNADDR3" edc:desc="" edc:mask="0x1" edc:name="STNADDR3" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STNADDR4" edc:desc="" edc:mask="0x1" edc:name="STNADDR4" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882320" edc:_begin="0x300" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1SA2" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="EMAC1SA2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxSA2"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STNADDR1" edc:desc="" edc:mask="0x1" edc:name="STNADDR1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STNADDR2" edc:desc="" edc:mask="0x1" edc:name="STNADDR2" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F882330" edc:offset="0x1CD0"/>
      <edc:SFRDef edc:_addr="0x1F884000" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02831_usb_clk_rst_v2.Module" edc:_refcount="1" edc:access="-----rnn--------------nnnnnnnnnn" edc:cname="USBCRCON" edc:desc="" edc:impl="0x70003ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000--------------0000000000" edc:name="USBCRCON" edc:nzwidth="32" edc:por="-----000--------------0000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USBWKUPEN" edc:mask="0x1" edc:name="USBWKUPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBRIE" edc:mask="0x1" edc:name="USBRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIE" edc:mask="0x1" edc:name="USBIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SENDMONEN" edc:mask="0x1" edc:name="SENDMONEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BSVALMONEN" edc:mask="0x1" edc:name="BSVALMONEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASVALMONEN" edc:mask="0x1" edc:name="ASVALMONEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBUSMONEN" edc:mask="0x1" edc:name="VBUSMONEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHYIDEN" edc:mask="0x1" edc:name="PHYIDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIDVAL" edc:mask="0x1" edc:name="USBIDVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIDOVEN" edc:mask="0x1" edc:name="USBIDOVEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="USBWKUP" edc:mask="0x1" edc:name="USBWKUP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBRF" edc:mask="0x1" edc:name="USBRF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIF" edc:mask="0x1" edc:name="USBIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f8e0000" edc:endaddr="0x1f8e7000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_indep">
      <edc:SFRDef edc:_addr="0x1F8E0000" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-01643_pfm_cache_ahb_v2.Module" edc:_refcount="1" edc:access="-----n--------------------nn-nnn" edc:cname="PRECON" edc:desc="" edc:impl="0x4000037" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0--------------------00-111" edc:name="PRECON" edc:nzwidth="32" edc:por="-----0--------------------00-111" edc:portals="CLR SET INV" ltx:baseofperipheral="PCACHE">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMWS" edc:desc="" edc:mask="0x7" edc:name="PFMWS" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PREFEN" edc:desc="" edc:mask="0x3" edc:name="PREFEN" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="20"/>
            <edc:SFRFieldDef edc:cname="PFMSECEN" edc:desc="" edc:mask="0x1" edc:name="PFMSECEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E0010" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-01643_pfm_cache_ahb_v2.Module" edc:_refcount="1" edc:access="----nn------------------nnnnnnnn" edc:cname="PRESTAT" edc:desc="" edc:impl="0xc0000ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00------------------00000000" edc:name="PRESTAT" edc:nzwidth="32" edc:por="----00------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PCACHE">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMSECCNT" edc:desc="" edc:mask="0xff" edc:name="PFMSECCNT" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="PFMSEC" edc:desc="" edc:mask="0x1" edc:name="PFMSEC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PFMDED" edc:desc="" edc:mask="0x1" edc:name="PFMDED" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E0020" edc:offset="0x1FE0"/>
      <edc:SFRDef edc:_addr="0x1F8E2000" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON1" edc:desc="SQI XIP Control Register 1" edc:impl="0x3fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u00000001011000000110000000000" edc:name="SQI1XCON1" edc:nzwidth="32" edc:por="--x00000001011000000110000000000" ltx:baseofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TYPECMD" edc:desc="The boot controller will send the command in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPECMD" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEADDR" edc:desc="The boot controller will send the address in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEADDR" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEMODE" edc:desc="The boot controller will send the mode in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEMODE" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEDUMMY" edc:desc="The boot controller will send the dummy in Single Lange, Dual Lane, or Quad Lane" edc:mask="0x3" edc:name="TYPEDUMMY" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lange mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEDATA" edc:desc="The boot controller will receive the data in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEDATA" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="READOPCODE" edc:desc="These bits contain the 8-bit op code value for read operation." edc:mask="0xff" edc:name="READOPCODE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="ADDRBYTES" edc:desc="" edc:mask="0x7" edc:name="ADDRBYTES" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Four address bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Three address bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Two address bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="One address bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Zero address bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DUMMYBYTES" edc:desc="Transmit Dummy Bytes bits" edc:mask="0x7" edc:name="DUMMYBYTES" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Transmit seven dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Transmit six dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Transmit five dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Transmit four dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Transmit three dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Transmit two dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Transmit one dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Transmit zero dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRCMD" edc:desc="SQI DDR Command Mode bit" edc:mask="0x1" edc:name="DDRCMD" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI command bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI command bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRADDR" edc:desc="SQI Address Mode bit" edc:mask="0x1" edc:name="DDRADDR" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI address bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI address bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRMODE" edc:desc="SQI DDR Mode bit" edc:mask="0x1" edc:name="DDRMODE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI mode bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI mode bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRDUMMY" edc:desc="SQI Dummy DDR Mode bit" edc:mask="0x1" edc:name="DDRDUMMY" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI dummy bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI dummy bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRDATA" edc:desc="SQI Data DDR Mode bit" edc:mask="0x1" edc:name="DDRDATA" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI data bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI data bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDRCMD" edc:desc="SQI Command in SDR Mode bit" edc:mask="0x1" edc:name="SDRCMD" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI command is in SDR mode and SQI data is in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI command is in DDR mode and SQI data is in DDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
